renesas/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx72m/r_lpc_rx72m.c
            if ((1 == SYSTEM.LVD1CR0.BIT.LVD1RI) || (1 == SYSTEM.LVD2CR0.BIT.LVD2RI))
            {
                return LPC_ERR_ILLEGAL;         /* Cannot enter DSW_Standby if LVD reset enable */
            }
        }

    }

    else if ((0 == SYSTEM.MSTPCRA.BIT.ACSE) && /* Check if entering Sleep Mode */
            (LPC_CLOCK_SWITCH_ENABLE == SYSTEM.RSTCKCR.BIT.RSTCKEN)) /* If Return Clock Switching is enabled */
    {
        /* When entering sleep mode with return clock switching enabled, the system clock must be the sub-clock */
        if ((LPC_SUB_CLOCK != SYSTEM.SCKCR3.WORD) && (LPC_LOCO != SYSTEM.SCKCR3.WORD))
        {
            return LPC_ERR_ILL_CLOCK_SOURCE; /* Cannot enter Sleep if System clock is not Subclock or LOCO */
        }
        
        rstckcr_rstcksel = (SYSTEM.RSTCKCR.BYTE & 0x07);

        /* Exiting from sleep-mode to medium-speed mode with the HOCO selected is not permitted */
        if (LPC_HOCO == rstckcr_rstcksel) /* If HOCO is chosen as the return clock */
        {
            if (1 == SYSTEM.HOCOPCR.BIT.HOCOPCNT)
            {
                return LPC_ERR_ILL_CLOCK_SOURCE;    /* Cannot enter Sleep if HOCO power off */
            }
        }
        

    }
    else if(1 == SYSTEM.MSTPCRA.BIT.ACSE) /* Check if entering All Clock Stop Mode */
    {
        if ((((LPC_ACS_CHK_MSTPCRA != (SYSTEM.MSTPCRA.LONG & LPC_ACS_CHK_MSTPCRA))
            ||(LPC_ACS_CHK_MSTPCRB != (SYSTEM.MSTPCRB.LONG & LPC_ACS_CHK_MSTPCRB)))
            ||(LPC_ACS_CHK_MSTPCRC != (SYSTEM.MSTPCRC.LONG & LPC_ACS_CHK_MSTPCRC)))
            ||(LPC_ACS_CHK_MSTPCRD != (SYSTEM.MSTPCRD.LONG & LPC_ACS_CHK_MSTPCRD)))
        {
            return LPC_ERR_ILLEGAL;             /* Cannot enter All Clock stop if Module stop release */
        }
        
        /* Check FENTRYC(b0) and FENTRYD(b7) */
        if (0x0000 != (FLASH.FENTRYR.WORD & 0x0081))
        {
            return LPC_ERR_ILLEGAL;         /* Cannot enter SW_Stanbay if P/E mode entry */
        }
    }
    else
    {
        /* nothing here */
    }

    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_lowpower_activate_check
 ********************************************************************************************************************/

#endif /* LPC_CFG_PARAM_CHECKING_ENABLE */


#endif /* BSP_MCU_RX72M */


/***********************************************************************************************************************
 * End of File
 ***********************************************************************************************************************/
